{
	"name": "English",
	"card.thinks": "More electricity!",
	"card.about": "I'm an 18-year-old junior programmer, enthusiastic designer, and first rank electrician. I'm a fourth-year engineering student.",
	"card.button": "My Github",
	"h1.stars": "It's always starry here",
	"h1.snow": "It's always snowy here",
	"h1.rain": "It's always rainy here",
	"h1.autumn": "It's always autumn here",
	"h1.enjoy": "This is the EtherCD developer's portfolio. Enjoy!",
	"h1.list.projects": "Projects",
	"h1.list.contacts": "Contacts",
	"h1.projects": "Projects",
	"button.mode.stars": "Stars",
	"button.mode.snow": "Snow",
	"button.mode.rain": "Rain",
	"button.mode.autumn": "Autumn",

	"can.title": "I can work with",
	"can.0": "Graphics",
	"can.1": "Connections",
	"can.2": "Integrations",

	"can.graphics.0": "I've worked with webgl, pixi.js, ctx, and sfml. I can create animations, render for games, and optimize rendering. I created UI in webgl using shaders and SVG. You can see my experience on the ",
	"can.graphics.1": "branch of this",
	"can.graphics.2": "project",
	"can.connections.0": "I understand network connections and data transfer optimization. I can effectively work with binary protocols, including protobuf, and I developed a binary protocol called LWF for the game.",
	"can.integrations.0": "I worked on integrating zig into node.js and integrating modifications within my",
	"can.integrations.1": " I developed my own solutions for runtime connection and module loading.",

	"projects.lwf.about": "Lightweight Format - A very compact, compression friendly, binary format for storing JSON like objects.",
	"projects.lwf.button": "lwf website",
	"projects.lwf.tooltip": "I created a format standard. I used my own developments to reduce the size of numbers and fractions (compact variant, fraction encoding).",
	"projects.pb.about": "A place where you can compete for a spot on the canvas with other players",
	"projects.pb.button": "Website",
	"projects.pb.tooltip": "A project that brings players together for the sake of creativity. Using zustand, preact, and pixi.js technologies.",
	"projects.mae.about": "Addon for Mystical Agriculture, adds new crop types and other ideas...",
	"projects.mae.button": "Curseforge",
	"projects.mae.tooltip": "Experience working with other people's code and integration."
}
