{
	"name": "Русский",
	"card.thinks": "Больше электричества!",
	"card.about": "Мне 18 лет, я начинающий программист, энтузиаст-дизайнер и первоклассный электрик. Я студент четвёртого курса инженерного факультета.",
	"card.button": "Мой Гитхаб",
	"h1.stars": "Здесь всегда звёздно",
	"h1.snow": "Здесь всегда снежно",
	"h1.rain": "Здесь всегда дождливо",
	"h1.autumn": "Здесь всегда осень",
	"h1.enjoy": "Это портфолио разработчика EtherCD. Приятного просмотра!",
	"h1.list.projects": "Проекты",
	"h1.list.contacts": "Контакты",
	"h1.projects": "Проекты",
	"button.mode.stars": "Звёзды",
	"button.mode.snow": "Снег",
	"button.mode.rain": "Дождь",
	"button.mode.autumn": "Осень",

	"can.title": "Я могу работать с",
	"can.0": "Графикой",
	"can.1": "Соединениями",
	"can.2": "Интеграциями",

	"can.graphics.0": "Я работал с WebGL, Pixi.js, CTX и SFML. Умею создавать анимацию, рендерить для игр и оптимизировать рендеринг. Я создал пользовательский интерфейс в WebGL с использованием шейдеров и SVG. Вы можете ознакомиться с моим опытом на",
	"can.graphics.1": "ветке этого",
	"can.graphics.2": "проекта",
	"can.connections.0": "Я разбираюсь в сетевых соединениях и оптимизации передачи данных. Умею эффективно работать с бинарными протоколами, включая Protobuf, и разработал для игры двоичный протокол LWF.",
	"can.integrations.0": "Я работал над интеграцией zig в node.js и интеграцией модификаций в мой",
	"can.integrations.1": "Я могу быстро разобраться в коде других разработчиков и интегрировать его с их кодом. Я разработал собственные решения для подключения во время выполнения и загрузки модулей.",

	"projects.lwf.about": "Lightweight Format - Очень компактный, подходящий для сжатия, двоичный формат для хранения объектов типа JSON.",
	"projects.lwf.button": "lwf вебсайт",
	"projects.lwf.tooltip": "Я создал стандарт формата. Использовал собственные разработки для уменьшения размера чисел и дробей (компактный варинт, кодирование дробей).",
	"projects.pb.about": "Место, где вы можете побороться за место на холсте вместе с другими игроками",
	"projects.pb.button": "Вебсайт",
	"projects.pb.tooltip": "Проект, объединяющий игроков ради творчества. Использует технологии zustand, preact и pixi.js.",
	"projects.mae.about": "Аддон на Mystical Agriculture, добавляет новые растения и другое...",
	"projects.mae.button": "Curseforge",
	"projects.mae.tooltip": "Опыт работы с чужим кодом и интеграцией."
}
